### Data Manipulation

Data Manipuliton and the analyis are key tasks in any data scicence or analyis project. Pandas - make data eaiser to clean,transform and extract insights from data.

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('data.csv')

print(df)

          Date Category  Value   Product  Sales Region
0   2023-01-01        A   28.0  Product1  754.0   East
1   2023-01-02        B   39.0  Product3  110.0  North
2   2023-01-03        C   32.0  Product2  398.0   East
3   2023-01-04        B    8.0  Product1  522.0   East
4   2023-01-05        B   26.0  Product3  869.0  North
5   2023-01-06        B   54.0  Product3  192.0   West
6   2023-01-07        A   16.0  Product1  936.0   East
7   2023-01-08        C   89.0  Product1  488.0   West
8   2023-01-09        C   37.0  Product3  772.0   West
9   2023-01-10        A   22.0  Product2  834.0   West
10  2023-01-11        B    7.0  Product1  842.0  North
11  2023-01-12        B   60.0  Product2    NaN   West
12  2023-01-13        A   70.0  Product3  628.0  South
13  2023-01-14        A   69.0  Product1  423.0   East
14  2023-01-15        A   47.0  Product2  893.0   West
15  2023-01-16        C    NaN  Product1  895.0  North
16  2023-01-17        C   93.0  Product2  511.0  South
17  2023-01-18        C    NaN  Product1  108.0   West
18  2023-01-19        A   31.0  Product2  578.0   West
19  2023-01-20        A   59.0  Product1  736.0   East
20  2023-01-21        C   82.0  Product3  606.0  South
21  2023-01-22        C   37.0  Product2  992.0  South
22  2023-01-23        B   62.0  Product3  942.0  North
23  2023-01-24        C   92.0  Product2  342.0   West
24  2023-01-25        A   24.0  Product2  458.0   East
25  2023-01-26        C   95.0  Product1  584.0   West
26  2023-01-27        C   71.0  Product2  619.0  North
27  2023-01-28        C   56.0  Product2  224.0  North
28  2023-01-29        B    NaN  Product3  617.0  North
29  2023-01-30        C   51.0  Product2  737.0  South
30  2023-01-31        B   50.0  Product3  735.0   West
31  2023-02-01        A   17.0  Product2  189.0   West
32  2023-02-02        B   63.0  Product3  338.0  South
33  2023-02-03        C   27.0  Product3    NaN   East
34  2023-02-04        C   70.0  Product3  669.0   West
35  2023-02-05        B   60.0  Product2    NaN   West
36  2023-02-06        C   36.0  Product3  177.0   East
37  2023-02-07        C    2.0  Product1    NaN  North
38  2023-02-08        C   94.0  Product1  408.0  South
39  2023-02-09        A   62.0  Product1  155.0   West
40  2023-02-10        B   15.0  Product1  578.0   East
41  2023-02-11        C   97.0  Product1  256.0   East
42  2023-02-12        A   93.0  Product3  164.0   West
43  2023-02-13        A   43.0  Product3  949.0   East
44  2023-02-14        A   96.0  Product3  830.0   East
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North

In [3]:
## fetch the first 5 row 
df.head(5)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [4]:
## fetch from last 
df.tail(5)

          Date Category  Value   Product  Sales Region
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North

In [ ]:
df.describe() ## all the statisic things will come - 
# count / mean / std / min / max

           Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000

In [7]:
df.dtypes

Date         object
Category     object
Value       float64
Product      object
Sales       float64
Region       object
dtype: object

In [9]:
## Handling missing Values 

# df.isnull() ## all trues are missing values 
df.isnull().any(axis=1)

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11     True
12    False
13    False
14    False
15     True
16    False
17     True
18    False
19    False
20    False
21    False
22    False
23    False
24    False
25    False
26    False
27    False
28     True
29    False
30    False
31    False
32    False
33     True
34    False
35     True
36    False
37     True
38    False
39    False
40    False
41    False
42    False
43    False
44    False
45    False
46    False
47    False
48    False
49    False
dtype: bool

In [ ]:
df.isnull().sum()

Date        0
Category    0
Value       3
Product     0
Sales       4
Region      0
dtype: int64

In [11]:
## Filling missing value to make data set complete

df_fill = df.fillna(0)  ## all missing values get 0
## we not fill with zero mainly ; if missing value is a numerical value then we fill it with the `mean` of values

In [13]:
manes = df['Sales'].mean()
print(manes)

557.1304347826087

In [16]:
## filling missing values with Mean 

df['Sales_FillNA'] = df['Sales'].fillna(df['Sales'].mean())

## new column Sales fill have value == df ka sales m fill kardo sales ke mean ko 

# df
 ## new column created by in old column all nAn replace with Mean

In [ ]:
# df['Value'].isnull()

# uncomment to see result

In [19]:
## Filling Nan Values 

df['Fill_Values'] = df['Value'].fillna(df['Value'].mean())

# df

In [20]:
df.dtypes

Date             object
Category         object
Value           float64
Product          object
Sales           float64
Region           object
Sales_FillNA    float64
Fill_Values     float64
dtype: object

In [ ]:
## Renaming Columns 
## Key Values {Pair}
df = df.rename(columns={'Date':'Sale_Date'})
df.head(3);

,Sale_Date,Category,Value,Product,Sales,Region,Sales_FillNA,Fill_Values
0,2023-01-01,A,28.0,Product1,754.0,East,754.0,28.0
1,2023-01-02,B,39.0,Product3,110.0,North,110.0,39.0
2,2023-01-03,C,32.0,Product2,398.0,East,398.0,32.0

In [ ]:
## Changing Data Types 

df['New_Values'] = df['Fill_Values'].astype(int); 
df.head(4)

,Sale_Date,Category,Value,Product,Sales,Region,Sales_FillNA,Fill_Values,New_Values
0,2023-01-01,A,28.0,Product1,754.0,East,754.0,28.0,28
1,2023-01-02,B,39.0,Product3,110.0,North,110.0,39.0,39
2,2023-01-03,C,32.0,Product2,398.0,East,398.0,32.0,32
3,2023-01-04,B,8.0,Product1,522.0,East,522.0,8.0,8

In [34]:
## Grouping 
df = pd.read_csv('data.csv')
grouped_mean = df.groupby('Product')['Value'].mean()
print(grouped_mean)

Product
Product1    46.214286
Product2    52.800000
Product3    55.166667
Name: Value, dtype: float64

In [35]:
## More then 1 

df.groupby(['Product', 'Region'])['Value'].sum()

Product   Region
Product1  East      292.0
          North       9.0
          South     100.0
          West      246.0
Product2  East       56.0
          North     127.0
          South     181.0
          West      428.0
Product3  East      202.0
          North     203.0
          South     215.0
          West      373.0
Name: Value, dtype: float64

In [36]:
## Aggregate multiple funcs

grounded= df.groupby('Region')['Value'].agg(['mean','sum','count'])
grounded

             mean     sum  count
Region
East    42.307692   550.0     13
North   37.666667   339.0      9
South   62.000000   496.0      8
West    61.588235  1047.0     17

In [40]:
## Marging and joining 

df1 = pd.DataFrame({'key' : ['A', 'B', 'C'], 'value1': [1,2,3]})
df2 = pd.DataFrame({'key' : ['D', 'B', 'C'], 'value1': [1,2,4]})
df1

  key  value1
0   A       1
1   B       2
2   C       3

In [41]:
df2

  key  value1
0   D       1
1   B       2
2   C       4

In [ ]:
#3# merging both 

merger=  pd.merge(df1, df2, on = 'key', how = 'inner');
merger ## merger the common one

  key  value1_x  value1_y
0   B         2         2
1   C         3         4